{
  "movies": [
    {
      "id": "21",
      "title": "Back to the Future",
      "poster": "/public/images/backtothefuture.jpg",
      "overview": "Eighties teenager Marty McFly is accidentally sent back in time to 1955 in a plutonium-powered DeLorean 'time machine' invented by his slightly mad scientist friend Doc Brown. He must make sure his high-school-age parents fall in love in order to save his own existence.",
      "year": 1985,
      "genre": "Adventure, Comedy, Sci-Fi",
      "rating": 8.5,
      "director": "Robert Zemeckis",
      "cast": [
        "Michael J. Fox",
        "Christopher Lloyd",
        "Lea Thompson"
      ]
    },
    {
      "id": "42",
      "title": "The Grand Budapest Hotel",
      "poster": "/public/images/budapesthotel.jpg",
      "overview": "The adventures of Gustave H, a legendary concierge at a famous European hotel between the wars, and Zero Moustafa, the lobby boy who becomes his most trusted friend. The story involves the theft and recovery of a priceless Renaissance painting and the battle for an enormous family fortune.",
      "year": 2014,
      "genre": "Comedy, Drama",
      "rating": 8.1,
      "director": "Wes Anderson",
      "cast": [
        "Ralph Fiennes",
        "Tony Revolori",
        "F. Murray Abraham"
      ]
    },
    {
      "id": "4",
      "title": "The Dark night",
      "poster": "/public/images/darkknight.jpg",
      "overview": "Batman raises the stakes in his war on crime. With the help of Lt. Jim Gordon and District Attorney Harvey Dent, Batman sets out to dismantle the remaining criminal organizations that plague the streets. The partnership proves to be effective, but they soon find themselves prey to a rising criminal mastermind known as the Joker.",
      "year": 2008,
      "genre": "Action, Crime, Drama",
      "rating": 9,
      "director": "Christopher Nolan",
      "cast": [
        "Christian Bale",
        "Heath Ledger",
        "Aaron Eckhart"
      ]
    },
    {
      "id": "27",
      "title": "Django Unchained",
      "poster": "/public/images/django.jpg",
      "overview": "With the help of a German bounty hunter, a freed slave sets out to rescue his wife from a brutal Mississippi plantation owner. Dr. King Schultz acquires Django and promises to free him upon capturing the Brittle brothers, leading them on a mission across the South.",
      "year": 2012,
      "genre": "Western, Drama",
      "rating": 8.4,
      "director": "Quentin Tarantino",
      "cast": [
        "Jamie Foxx",
        "Christoph Waltz",
        "Leonardo DiCaprio"
      ]
    },
    {
      "id": "35",
      "title": "Avengers: Endgame",
      "poster": "/public/images/endgame.jpg",
      "overview": "After the devastating events of Avengers: Infinity War, the universe is in ruins. With the help of remaining allies, the Avengers assemble once more in order to reverse Thanos' actions and restore balance to the universe.",
      "year": 2019,
      "genre": "Action, Adventure, Sci-Fi",
      "rating": 8.2,
      "director": "Anthony Russo, Joe Russo",
      "cast": [
        "Robert Downey Jr.",
        "Chris Evans",
        "Mark Ruffalo"
      ]
    },
    {
      "id": "7",
      "title": "MYM MYDJDKDJFKDJFKDJFKDJFKDF",
      "poster": "/public/images/fightclub.jpg",
      "overview": "A ticking-time-bomb insomniac and a slippery soap salesman channel primal male aggression into a shocking new form of therapy. Their concept catches on, with underground 'fight clubs' forming in every town, until potentially dangerous entries spiral out of control.",
      "year": 1999,
      "genre": "Drama",
      "rating": 8.8,
      "director": "David Fincher",
      "cast": [
        "Brad Pitt",
        "Edward Norton",
        "Helena Bonham Carter"
      ]
    },
    {
      "id": "6",
      "title": "Forrest Gump",
      "poster": "/public/images/forrestgump.jpg",
      "overview": "A man with a low IQ has accomplished great things in his life and been present during significant historical events—in each case, far exceeding what anyone imagined he could do. But despite all he has achieved, his one true love eludes him.",
      "year": 1994,
      "genre": "Comedy, Drama, Romance",
      "rating": 8.8,
      "director": "Robert Zemeckis",
      "cast": [
        "Tom Hanks",
        "Robin Wright",
        "Gary Sinise"
      ]
    },
    {
      "id": "3",
      "title": "The Godfather",
      "poster": "/public/images/godfather.jpg",
      "overview": "Spanning the years 1945 to 1955, a chronicle of the fictional Italian-American Corleone crime family. When organized crime family patriarch, Vito Corleone, barely survives an attempt on his life, his youngest son, Michael, steps in to take care of the would-be killers.",
      "year": 1972,
      "genre": "Drama, Crime",
      "rating": 9.2,
      "director": "Francis Ford Coppola",
      "cast": [
        "Marlon Brando",
        "Al Pacino",
        "James Caan"
      ]
    },
    {
      "id": "1",
      "title": "Inception",
      "poster": "/public/images/inception.jpg",
      "overview": "Dom Cobb is a skilled thief who steals secrets from deep within the subconscious during the dream state. He is given a chance at redemption by performing inception: planting an idea into a target’s mind. As he assembles his team, Cobb faces dangers that blur the line between dream and reality.",
      "year": 2010,
      "genre": "Sci-Fi, Thriller, Action",
      "rating": 8.8,
      "director": "Christopher Nolan",
      "cast": [
        "Leonardo DiCaprio",
        "Joseph Gordon-Levitt",
        "Elliot Page"
      ]
    },
    {
      "id": "10",
      "title": "Interstellar",
      "poster": "/public/images/interstellar.jpg",
      "overview": "In Earth's future, a global crop blight and second Dust Bowl are slowly rendering the planet uninhabitable. Professor Brand, a brilliant NASA physicist, is working on plans to save mankind by transporting Earth's population to a new home via a wormhole. But first, Brand must send former NASA pilot Cooper on a daring mission.",
      "year": 2014,
      "genre": "Adventure, Drama, Sci-Fi",
      "rating": 8.6,
      "director": "Christopher Nolan",
      "cast": [
        "Matthew McConaughey",
        "Anne Hathaway",
        "Jessica Chastain"
      ]
    },
    {
      "id": "24",
      "title": "Joker",
      "poster": "/public/images/joker.jpg",
      "overview": "During the 1980s, a failed stand-up comedian is driven insane and turns to a life of crime and chaos in Gotham City while becoming an infamous psychopathic crime figure. Arthur Fleck's descent into madness brings him face-to-face with his alter-ego: the Joker.",
      "year": 2019,
      "genre": "Crime, Thriller, Drama",
      "rating": 8.2,
      "director": "Todd Phillips",
      "cast": [
        "Joaquin Phoenix",
        "Robert De Niro",
        "Zazie Beetz"
      ]
    },
    {
      "id": "12",
      "title": "The Lord of the Rings: The Return of the King",
      "poster": "/public/images/lotr3.jpg",
      "overview": "Aragorn is revealed as the heir to the ancient kings as he, Gandalf and the other members of the broken fellowship struggle to save Gondor from Sauron's forces. Meanwhile, Frodo and Sam take the final steps of their quest to destroy the One Ring.",
      "year": 2003,
      "genre": "Adventure, Fantasy, Action",
      "rating": 8.9,
      "director": "Peter Jackson",
      "cast": [
        "Elijah Wood",
        "Ian McKellen",
        "Viggo Mortensen"
      ]
    },
    {
      "id": "25",
      "title": "Mad Max: Fury Road",
      "poster": "/public/images/madmax.jpg",
      "overview": "An apocalyptic story set in the furthest reaches of our planet, in a stark desert landscape where humanity is broken, and everyone is fighting for the necessities of life. Within this world exist two rebels on the run who just might be able to restore order: Max, a man of action and of few words, and Furiosa, a woman of action who believes her path to survival may be achieved if she can make it across the desert back to her childhood homeland.",
      "year": 2015,
      "genre": "Action, Adventure, Sci-Fi",
      "rating": 7.6,
      "director": "George Miller",
      "cast": [
        "Tom Hardy",
        "Charlize Theron",
        "Nicholas Hoult"
      ]
    },
    {
      "id": "39",
      "title": "Oppenheimer",
      "poster": "/public/images/oppenheimer.jpg",
      "overview": "The story of American scientist J. Robert Oppenheimer and his role in the development of the atomic bomb. The film follows him as he navigates the political and moral complexities of the Manhattan Project during World War II.",
      "year": 2023,
      "genre": "Drama, History, Thriller",
      "rating": 8.3,
      "director": "Christopher Nolan",
      "cast": [
        "Cillian Murphy",
        "Emily Blunt",
        "Matt Damon"
      ]
    },
    {
      "id": "9",
      "title": "Parasite",
      "poster": "/public/images/parasite.jpg",
      "overview": "All unemployed, Ki-taek's family takes peculiar interest in the wealthy and glamorous Parks for their livelihood until they get entangled in an unexpected incident. Greed and class discrimination threaten the newly formed symbiotic relationship between the wealthy Park family and the destitute Kim clan.",
      "year": 2019,
      "genre": "Thriller, Comedy, Drama",
      "rating": 8.5,
      "director": "Bong Joon-ho",
      "cast": [
        "Song Kang-ho",
        "Lee Sun-kyun",
        "Cho Yeo-jeong"
      ]
    }
  ],
  "favorites": [
    {
      "id": "84bf",
      "movieId": "4",
      "note": "Loved it!"
    }
  ]
}